ghi-electronics/TinyCLR-Ports/Targets/LPC23xx_LPC24xx/LPC24_CAN.cpp
    uint32_t *lowerBoundFilters;
    uint32_t *upperBoundFilters;
    uint32_t groupFiltersSize;

};

typedef struct {
    uint32_t timeStampL;
    uint32_t timeStampH;

    uint32_t msgId;

    bool extendedId;
    bool remoteTransmissionRequest;

    uint32_t dataA;
    uint32_t dataB;

    int32_t length;

} LPC24_Can_Message;

struct CanState {
    int32_t controllerIndex;

    const TinyCLR_Can_Controller* provider;

    LPC24_Can_Message *canRxMessagesFifo;

    TinyCLR_Can_ErrorReceivedHandler   errorEventHandler;
    TinyCLR_Can_MessageReceivedHandler    messageReceivedEventHandler;

    int32_t can_rx_count;
    int32_t can_rx_in;
    int32_t can_rx_out;

    size_t can_rxBufferSize;
    size_t can_txBufferSize;

    uint32_t baudrate;

    LPC24_Can_Filter canDataFilter;

    bool isOpened;
};

static const LPC24_Gpio_Pin canTxPins[] = LPC24_CAN_TX_PINS;
static const LPC24_Gpio_Pin canRxPins[] = LPC24_CAN_RX_PINS;

#define TOTAL_CAN_CONTROLLERS  SIZEOF_ARRAY(canTxPins)

static CanState canStates[TOTAL_CAN_CONTROLLERS];

static TinyCLR_Can_Controller canControllers[TOTAL_CAN_CONTROLLERS];
static TinyCLR_Api_Info canApi[TOTAL_CAN_CONTROLLERS];

void CAN_DisableExplicitFilters(int32_t controllerIndex) {
    DISABLE_INTERRUPTS_SCOPED(irq);

    auto state = &canStates[controllerIndex];

    auto memoryProvider = (const TinyCLR_Memory_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::MemoryManager);

    if (state->canDataFilter.matchFiltersSize && state->canDataFilter.matchFilters != nullptr) {
        memoryProvider->Free(memoryProvider, state->canDataFilter.matchFilters);

        state->canDataFilter.matchFiltersSize = 0;
    }
}

void CAN_DisableGroupFilters(int32_t controllerIndex) {
    DISABLE_INTERRUPTS_SCOPED(irq);

    auto state = &canStates[controllerIndex];

    auto memoryProvider = (const TinyCLR_Memory_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::MemoryManager);

    if (state->canDataFilter.groupFiltersSize) {
        if (state->canDataFilter.lowerBoundFilters != nullptr)
            memoryProvider->Free(memoryProvider, state->canDataFilter.lowerBoundFilters);

        if (state->canDataFilter.upperBoundFilters != nullptr)
            memoryProvider->Free(memoryProvider, state->canDataFilter.upperBoundFilters);

        state->canDataFilter.groupFiltersSize = 0;
    }
}

/******************************************************************************
** Function name:        CAN_SetACCF_Lookup
**
** Descriptions:        Initialize CAN, install CAN interrupt handler
**
** parameters:            bitrate
** Returned value:        true or false, false if initialization failed.
**
******************************************************************************/
void CAN_SetACCF_Lookup(void) {
    uint32_t address = 0;
    uint32_t i;
    uint32_t ID_high, ID_low;

    // Set explicit standard Frame
    SFF_sa = address;
    for (i = 0; i < ACCF_IDEN_NUM; i += 2) {
        ID_low = (i << 29) | (EXP_STD_ID << 16);
        ID_high = ((i + 1) << 13) | (EXP_STD_ID << 0);
        *((volatile uint32_t *)(CAN_MEM_BASE + address)) = ID_low | ID_high;
        address += 4;
    }

    // Set group standard Frame
    SFF_GRP_sa = address;
    for (i = 0; i < ACCF_IDEN_NUM; i += 2) {
        ID_low = (i << 29) | (GRP_STD_ID << 16);
        ID_high = ((i + 1) << 13) | (GRP_STD_ID << 0);
        *((volatile uint32_t *)(CAN_MEM_BASE + address)) = ID_low | ID_high;
        address += 4;
    }

    // Set explicit extended Frame
    EFF_sa = address;
    for (i = 0; i < ACCF_IDEN_NUM; i++) {
        ID_low = (i << 29) | (EXP_EXT_ID << 0);
        *((volatile uint32_t *)(CAN_MEM_BASE + address)) = ID_low;
        address += 4;
    }

    // Set group extended Frame
    EFF_GRP_sa = address;
    for (i = 0; i < ACCF_IDEN_NUM; i++) {
        ID_low = (i << 29) | (GRP_EXT_ID << 0);
        *((volatile uint32_t *)(CAN_MEM_BASE + address)) = ID_low;
        address += 4;
    }

    // Set End of Table
    ENDofTable = address;
    return;
}

/******************************************************************************
** Function name:        CAN_SetACCF
**
** Descriptions:        Set acceptance filter and SRAM associated with
**
** parameters:            ACMF mode
** Returned value:        None
**
**
******************************************************************************/
void CAN_SetACCF(uint32_t ACCFMode) {
    switch (ACCFMode) {
    case ACCF_OFF:
        AFMR = ACCFMode;
        C1MOD = C2MOD = 1;    // Reset CAN
        C1IER = C2IER = 0;    // Disable Receive Interrupt
        C1GSR = C2GSR = 0;    // Reset error counter when CANxMOD is in reset
        break;

    case ACCF_BYPASS:
        AFMR = ACCFMode;
        break;

    case ACCF_ON:
    case ACCF_FULLCAN:
        AFMR = ACCF_OFF;
        CAN_SetACCF_Lookup();
        AFMR = ACCFMode;
        break;

    default:
        break;
    }
    return;
}

bool InsertionSort2CheckOverlap(uint32_t *lowerBounds, uint32_t *upperBounds, int32_t length) {

    uint32_t i, j, tmp, tmp2;

    for (i = 1; i < length; i++) {
        j = i;

        while (j > 0 && lowerBounds[j - 1] > lowerBounds[j]) {
            tmp = lowerBounds[j]; tmp2 = upperBounds[j];
            lowerBounds[j] = lowerBounds[j - 1];    upperBounds[j] = upperBounds[j - 1];
            lowerBounds[j - 1] = tmp;    upperBounds[j - 1] = tmp2;

            j--;
        }
    }

    // check for overlap
    if (lowerBounds[0] > upperBounds[0])
        return false;

    for (i = 1; i < length; i++) {
        if (lowerBounds[i] > upperBounds[i])
            return false;

        if (lowerBounds[i] <= upperBounds[i - 1])
            return false;
    }

    return true;
}

int32_t BinarySearch(uint32_t *sortedArray, int32_t first, int32_t last, uint32_t key) {
    int32_t mid;
    while (first <= last) {
        mid = (first + last) / 2;  // compute mid point.
        if (key > sortedArray[mid])
            first = mid + 1;  // repeat search in top half.
        else if (key < sortedArray[mid])
            last = mid - 1; // repeat search in bottom half.
        else
            return mid;     // found it. return position /////
    }

