ghi-electronics/TinyCLR-Ports/Targets/LPC23xx_LPC24xx/LPC24_CAN.cpp
    return -1;    // failed to find key
}

int32_t BinarySearch2(uint32_t *lowerBounds, uint32_t *upperBounds, int32_t first, int32_t last, uint32_t key) {

    int32_t mid;

    while (first <= last) {
        mid = (first + last) / 2;  // compute mid point.

        if (key > upperBounds[mid])
            first = mid + 1;  // repeat search in top half.
        else if (key < lowerBounds[mid])
            last = mid - 1; // repeat search in bottom half.
        else
            return mid;     // found it. return position /////
    }

    return -1;    // failed to find key
}

const TinyCLR_Api_Info* LPC24_Can_GetApi() {
    for (int32_t i = 0; i < TOTAL_CAN_CONTROLLERS; i++) {
        canControllers[i].ApiInfo = &canApi[i];
        canControllers[i].Acquire = &LPC24_Can_Acquire;
        canControllers[i].Release = &LPC24_Can_Release;
        canControllers[i].Enable = &LPC24_Can_Enable;
        canControllers[i].Disable = &LPC24_Can_Disable;
        canControllers[i].CanWriteMessage = &LPC24_Can_CanWriteMessage;
        canControllers[i].CanReadMessage = &LPC24_Can_CanReadMessage;
        canControllers[i].WriteMessage = &LPC24_Can_WriteMessage;
        canControllers[i].ReadMessage = &LPC24_Can_ReadMessage;
        canControllers[i].SetBitTiming = &LPC24_Can_SetBitTiming;
        canControllers[i].GetUnreadMessageCount = &LPC24_Can_GetUnreadMessageCount;
        canControllers[i].SetMessageReceivedHandler = &LPC24_Can_SetMessageReceivedHandler;
        canControllers[i].SetErrorReceivedHandler = &LPC24_Can_SetErrorReceivedHandler;
        canControllers[i].SetExplicitFilters = &LPC24_Can_SetExplicitFilters;
        canControllers[i].SetGroupFilters = &LPC24_Can_SetGroupFilters;
        canControllers[i].ClearReadBuffer = &LPC24_Can_ClearReadBuffer;        
        canControllers[i].GetWriteErrorCount = &LPC24_Can_GetWriteErrorCount;
        canControllers[i].GetReadErrorCount = &LPC24_Can_GetReadErrorCount;
        canControllers[i].GetSourceClock = &LPC24_Can_GetSourceClock;
        canControllers[i].GetReadBufferSize = &LPC24_Can_GetReadBufferSize;
        canControllers[i].SetReadBufferSize = &LPC24_Can_SetReadBufferSize;
        canControllers[i].GetWriteBufferSize = &LPC24_Can_GetWriteBufferSize;
        canControllers[i].SetWriteBufferSize = &LPC24_Can_SetWriteBufferSize;

        canApi[i].Author = "GHI Electronics, LLC";
        canApi[i].Name = "GHIElectronics.TinyCLR.NativeApis.LPC24.CanController";
        canApi[i].Type = TinyCLR_Api_Type::CanController;
        canApi[i].Version = 0;
        canApi[i].Implementation = &canControllers[i];
        canApi[i].State = &canStates[i];

        canStates[i].controllerIndex = i;
    }

    return (const TinyCLR_Api_Info*)&canApi;
}

uint32_t LPC24_Can_GetLocalTime() {
    return LPC24_Time_GetTimeForProcessorTicks(nullptr, LPC24_Time_GetCurrentProcessorTicks(nullptr));
}

/******************************************************************************
** Function name:        CAN_ISR_Rx
**
** Descriptions:        CAN Rx1 interrupt handler
**
** parameters:            None
** Returned value:        None
**
******************************************************************************/
void CAN_ISR_Rx(int32_t controllerIndex) {
    auto state = &canStates[controllerIndex];

    // filter
    if (state->canDataFilter.groupFiltersSize || state->canDataFilter.matchFiltersSize) {
        uint32_t ID = controllerIndex == 0 ? C1RID : C2RID;

        char passed = 0;

        if (state->canDataFilter.groupFiltersSize) {
            if (BinarySearch2(state->canDataFilter.lowerBoundFilters, state->canDataFilter.upperBoundFilters, 0, state->canDataFilter.groupFiltersSize - 1, ID) >= 0)
                passed = 1;
        }

        if (!passed && state->canDataFilter.matchFiltersSize) {
            if (BinarySearch(state->canDataFilter.matchFilters, 0, state->canDataFilter.matchFiltersSize - 1, ID) >= 0)
                passed = 1;
        }

        if (!passed) {
            if (controllerIndex == 0)
                C1CMR = 0x04; // release receive buffer
            else
                C2CMR = 0x04; // release receive buffer
            return;
        }
    }

    if (state->can_rx_count > (state->can_rxBufferSize - 3)) {
        if (controllerIndex == 0)
            C1CMR = 0x04; // release receive buffer
        else
            C2CMR = 0x04; // release receive buffer

        state->errorEventHandler(state->provider, TinyCLR_Can_Error::BufferFull);

        return;
    }

    // initialize destination pointer
    LPC24_Can_Message *can_msg = &state->canRxMessagesFifo[state->can_rx_in];

    // timestamp
    uint64_t t = LPC24_Can_GetLocalTime();

    can_msg->timeStampL = t & 0xFFFFFFFF;
    can_msg->timeStampH = t >> 32;

    uint32_t flag;
    uint32_t dataA;
    uint32_t dataB;
    uint32_t msgId;

    if (controllerIndex == 0) {
        flag = C1RFS;  // Frame
        msgId = C1RID;
        dataA = C1RDA;
        dataB = C1RDB;
        C1CMR = 0x04; // release receive buffer
    }
    else {
        flag = C2RFS;  // Frame
        msgId = C2RID;
        dataA = C2RDA;
        dataB = C2RDB;
        C2CMR = 0x04; // release receive buffer
    }

    can_msg->length = (flag >> 16) & 0x0F;

    can_msg->extendedId = ((flag & 0x80000000) != 0) ? true : false;

    can_msg->remoteTransmissionRequest = ((flag & 0x40000000) != 0) ? true : false;

    can_msg->msgId = msgId; // ID

    can_msg->dataA = dataA; // Data A

    can_msg->dataB = dataB; // Data B

    state->can_rx_count++;
    state->can_rx_in++;

    if (state->can_rx_in == state->can_rxBufferSize) {
        state->can_rx_in = 0;
    }

    state->messageReceivedEventHandler(state->provider, state->can_rx_count);
}
void LPC24_Can_RxInterruptHandler(void *param) {
    uint32_t status = CANRxSR;

    int32_t controllerIndex;

    DISABLE_INTERRUPTS_SCOPED(irq);

    if (status & (1 << 8)) {
        controllerIndex = 0;

        auto state = &canStates[controllerIndex];

        uint32_t c1 = CAN1ICR;

        CAN_ISR_Rx(controllerIndex);

        if (c1 & (1 << 3)) {
            state->errorEventHandler(state->provider, TinyCLR_Can_Error::Overrun);
        }
        if (c1 & (1 << 5)) {
            state->errorEventHandler(state->provider, TinyCLR_Can_Error::Passive);
        }
        if (c1 & (1 << 7)) {
            C1MOD = 1;    // Reset CAN
            state->errorEventHandler(state->provider, TinyCLR_Can_Error::BusOff);
        }

