ghi-electronics/TinyCLR-Ports/Targets/LPC23xx_LPC24xx/LPC24_CAN.cpp
    }
    if (status & (1 << 9)) {
        controllerIndex = 1;

        auto state = &canStates[controllerIndex];

        uint32_t c2 = CAN2ICR;

        CAN_ISR_Rx(controllerIndex);

        if (c2 & (1 << 3)) {
            state->errorEventHandler(state->provider, TinyCLR_Can_Error::Overrun);
        }
        if (c2 & (1 << 5)) {
            state->errorEventHandler(state->provider, TinyCLR_Can_Error::Passive);
        }
        if (c2 & (1 << 7)) {
            C2MOD = 1;    // Reset CAN
            state->errorEventHandler(state->provider, TinyCLR_Can_Error::BusOff);
        }
    }
}

TinyCLR_Result LPC24_Can_Acquire(const TinyCLR_Can_Controller* self) {
    if (self == nullptr)
        return TinyCLR_Result::ArgumentNull;

    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);
    auto controllerIndex = state->controllerIndex;

    if (!LPC24_Gpio_OpenPin(canTxPins[controllerIndex].number))
        return TinyCLR_Result::SharingViolation;

    if (!LPC24_Gpio_OpenPin(canRxPins[controllerIndex].number))
        return TinyCLR_Result::SharingViolation;

    // set pin as analog
    LPC24_Gpio_ConfigurePin(canTxPins[controllerIndex].number, LPC24_Gpio_Direction::Input, canTxPins[controllerIndex].pinFunction, LPC24_Gpio_PinMode::Inactive);
    LPC24_Gpio_ConfigurePin(canRxPins[controllerIndex].number, LPC24_Gpio_Direction::Input, canRxPins[controllerIndex].pinFunction, LPC24_Gpio_PinMode::Inactive);

    state->can_rx_count = 0;
    state->can_rx_in = 0;
    state->can_rx_out = 0;
    state->baudrate = 0;
    state->can_rxBufferSize = canDefaultBuffersSize[controllerIndex];
    state->provider = self;

    state->canDataFilter.matchFiltersSize = 0;
    state->canDataFilter.groupFiltersSize = 0;

    state->canRxMessagesFifo = nullptr;

    if (controllerIndex == 0)
        LPC24XX::SYSCON().PCONP |= (1 << 13);    // Enable clock to the peripheral

    if (controllerIndex == 1)
        LPC24XX::SYSCON().PCONP |= (1 << 14);    // Enable clock to the peripheral

    CAN_SetACCF(ACCF_BYPASS);

    state->isOpened = true;

    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC24_Can_Release(const TinyCLR_Can_Controller* self) {
    if (self == nullptr)
        return TinyCLR_Result::ArgumentNull;

    auto memoryProvider = (const TinyCLR_Memory_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::MemoryManager);

    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);
    auto controllerIndex = state->controllerIndex;

    if (state->canRxMessagesFifo != nullptr) {
        memoryProvider->Free(memoryProvider, state->canRxMessagesFifo);

        state->canRxMessagesFifo = nullptr;
    }

    CAN_DisableExplicitFilters(controllerIndex);
    CAN_DisableGroupFilters(controllerIndex);

    if (state->isOpened) {
        LPC24_Gpio_ClosePin(canTxPins[controllerIndex].number);
        LPC24_Gpio_ClosePin(canRxPins[controllerIndex].number);
    }

    state->isOpened = false;

    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC24_Can_SoftReset(const TinyCLR_Can_Controller* self) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);
    auto controllerIndex = state->controllerIndex;

    state->can_rx_count = 0;
    state->can_rx_in = 0;
    state->can_rx_out = 0;

    // Reset CAN
    if (controllerIndex == 0) {
        C1MOD = 1;    // Reset CAN
        C1IER = 0;    // Disable Receive Interrupt
        C1GSR = 0;    // Reset error counter when CANxMOD is in reset
        C1BTR = state->baudrate;
        C1MOD = 0x4;    // CAN in normal operation mode
        C1IER = 0x01 | (1 << 7) | (1 << 3) | (1 << 5);    // Enable receive interrupts

    }
    else {
        C2MOD = 1;    // Reset CAN
        C2IER = 0;    // Disable Receive Interrupt
        C2GSR = 0;    // Reset error counter when CANxMOD is in reset
        C2BTR = state->baudrate;
        C2MOD = 0x4;    // CAN in normal operation mode
        C2IER = 0x01 | (1 << 7) | (1 << 3) | (1 << 5);    // Enable receive interrupts
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC24_Can_WriteMessage(const TinyCLR_Can_Controller* self, uint32_t arbitrationId, bool isExtendedId, bool isRemoteTransmissionRequest, const uint8_t* data, size_t length) {

    uint32_t *data32 = (uint32_t*)data;

    uint32_t flags = 0;
    uint32_t status;

    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);
    auto controllerIndex = state->controllerIndex;

    if (isExtendedId)
        flags |= 0x80000000;

    if (isRemoteTransmissionRequest)
        flags |= 0x40000000;

    flags |= (length & 0x0F) << 16;

    uint32_t timeout = CAN_TRANSFER_TIMEOUT;

    while (LPC24_Can_CanWriteMessage(self) == false && timeout-- > 0) {        
        LPC24_Time_Delay(nullptr, 1);
    }

    if (timeout == 0)
        return TinyCLR_Result::Busy;

    if (controllerIndex == 0) {
        status = C1SR;

        if (status & 0x00000004) {
            C1TFI1 = flags & 0xC00F0000;
            C1TID1 = arbitrationId;
            C1TDA1 = data32[0];
            C1TDB1 = data32[1];

            C1CMR = 0x21;

            return TinyCLR_Result::Success;
        }
    }
    else {
        status = C2SR;

        if (status & 0x00000004) {
            C2TFI1 = flags & 0xC00F0000;
            C2TID1 = arbitrationId;
            C2TDA1 = data32[0];
            C2TDB1 = data32[1];

            C2CMR = 0x21;

            return TinyCLR_Result::Success;
        }
    }

    return TinyCLR_Result::Busy;
}

TinyCLR_Result LPC24_Can_ReadMessage(const TinyCLR_Can_Controller* self, uint32_t& arbitrationId, bool& isExtendedId, bool& isRemoteTransmissionRequest, uint8_t* data, size_t& length, uint64_t& timestamp) {
    LPC24_Can_Message *can_msg;

    uint32_t *data32 = (uint32_t*)data;

    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    if (state->can_rx_count) {
        DISABLE_INTERRUPTS_SCOPED(irq);

        can_msg = &state->canRxMessagesFifo[state->can_rx_out];
        state->can_rx_out++;

        if (state->can_rx_out == state->can_rxBufferSize)
            state->can_rx_out = 0;

        state->can_rx_count--;

        arbitrationId = can_msg->msgId;
        isExtendedId = can_msg->extendedId;
        isRemoteTransmissionRequest = can_msg->remoteTransmissionRequest;

        data32[0] = can_msg->dataA;
        data32[1] = can_msg->dataB;

        length = can_msg->length;

