ghi-electronics/TinyCLR-Ports/Targets/LPC23xx_LPC24xx/LPC24_CAN.cpp
    return TinyCLR_Result::Success;
}

size_t LPC24_Can_GetReadErrorCount(const TinyCLR_Can_Controller* self) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);
    auto controllerIndex = state->controllerIndex;

    return controllerIndex == 0 ? ((C1GSR >> 16) & 0xFF) : ((C2GSR >> 16) & 0xFF);
}

size_t LPC24_Can_GetWriteErrorCount(const TinyCLR_Can_Controller* self) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);
    auto controllerIndex = state->controllerIndex;

    return controllerIndex == 0 ? (C1GSR >> 24) : (C2GSR >> 24);
}

uint32_t LPC24_Can_GetSourceClock(const TinyCLR_Can_Controller* self) {
    return LPC24_AHB_CLOCK_HZ;
}

size_t LPC24_Can_GetReadBufferSize(const TinyCLR_Can_Controller* self) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);
    auto controllerIndex = state->controllerIndex;

	return state->can_rxBufferSize == 0 ? canDefaultBuffersSize[controllerIndex] : state->can_rxBufferSize;
}

TinyCLR_Result LPC24_Can_SetReadBufferSize(const TinyCLR_Can_Controller* self, size_t size) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);
    auto controllerIndex = state->controllerIndex;

    if (size > 3) {
        state->can_rxBufferSize = size;
        return TinyCLR_Result::Success;
    }
    else {
        state->can_rxBufferSize = canDefaultBuffersSize[controllerIndex];
        return TinyCLR_Result::ArgumentInvalid;;
    }
}

size_t LPC24_Can_GetWriteBufferSize(const TinyCLR_Can_Controller* self) {
	return 1;
}

TinyCLR_Result LPC24_Can_SetWriteBufferSize(const TinyCLR_Can_Controller* self, size_t size) {
    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);

    state->can_txBufferSize = 1;

    return size == 1 ? TinyCLR_Result::Success : TinyCLR_Result::NotSupported;
}

void LPC24_Can_Reset() {
    for (int i = 0; i < TOTAL_CAN_CONTROLLERS; i++) {
        canStates[i].canRxMessagesFifo = nullptr;

        LPC24_Can_Release(&canControllers[i]);

        canStates[i].isOpened = false;
    }
}

TinyCLR_Result LPC24_Can_GetControllerCount(const TinyCLR_Can_Controller* self, int32_t& count) {
    count = TOTAL_CAN_CONTROLLERS;

    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC24_Can_Enable(const TinyCLR_Can_Controller* self) {
    return TinyCLR_Result::NotImplemented;
}

TinyCLR_Result LPC24_Can_Disable(const TinyCLR_Can_Controller* self) {
    return TinyCLR_Result::NotImplemented;
}

bool LPC24_Can_CanWriteMessage(const TinyCLR_Can_Controller* self) {
    uint32_t status = 0;

    auto allowed = false;

    auto state = reinterpret_cast<CanState*>(self->ApiInfo->State);
    auto controllerIndex = state->controllerIndex;

    status = controllerIndex == 0 ? C1SR : C2SR;

    if ((status & 0x00000004) &&
        (status & 0x00000400) &&
        (status & 0x00040000)) {
        allowed = true;
    }
	
	return false;
}

bool LPC24_Can_CanReadMessage(const TinyCLR_Can_Controller* self) {
    return true;
}
#endif // INCLUDE_CAN
